espressif/esp-idf/components/soc/esp32c5/register/soc/sdio_slc_host_struct.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Group: ********Registers */
/** Type of func2_0 register
 *  *******Description***********
 */
typedef union {
    struct {
        uint32_t reserved_0:24;
        /** slc_func2_int : R/W; bitpos: [24]; default: 0;
         *  *******Description***********
         */
        uint32_t slc_func2_int:1;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} sdio_slc_host_func2_0_reg_t;

/** Type of func2_1 register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slc_func2_int_en : R/W; bitpos: [0]; default: 0;
         *  *******Description***********
         */
        uint32_t slc_func2_int_en:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} sdio_slc_host_func2_1_reg_t;

/** Type of func2_2 register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slc_func1_mdstat : R/W; bitpos: [0]; default: 1;
         *  *******Description***********
         */
        uint32_t slc_func1_mdstat:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} sdio_slc_host_func2_2_reg_t;

/** Type of gpio_status0 register
 *  *******Description***********
 */
typedef union {
    struct {
        /** gpio_sdio_int0 : RO; bitpos: [31:0]; default: 0;
         *  *******Description***********
         */
        uint32_t gpio_sdio_int0:32;
    };
    uint32_t val;
} sdio_slc_host_gpio_status0_reg_t;

/** Type of gpio_status1 register
 *  *******Description***********
 */
typedef union {
    struct {
        /** gpio_sdio_int1 : RO; bitpos: [31:0]; default: 0;
         *  *******Description***********
         */
        uint32_t gpio_sdio_int1:32;
    };
    uint32_t val;
} sdio_slc_host_gpio_status1_reg_t;

/** Type of gpio_in0 register
 *  *******Description***********
 */
typedef union {
    struct {
        /** gpio_sdio_in0 : RO; bitpos: [31:0]; default: 0;
         *  *******Description***********
         */
        uint32_t gpio_sdio_in0:32;
    };
    uint32_t val;
} sdio_slc_host_gpio_in0_reg_t;

/** Type of gpio_in1 register
 *  *******Description***********
 */
typedef union {
    struct {
        /** gpio_sdio_in1 : RO; bitpos: [31:0]; default: 0;
         *  *******Description***********
         */
        uint32_t gpio_sdio_in1:32;
    };
    uint32_t val;
} sdio_slc_host_gpio_in1_reg_t;

/** Type of slc0host_token_rdata register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slc0_token0 : RO; bitpos: [11:0]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_token0:12;
        /** slc0_rx_pf_valid : RO; bitpos: [12]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_rx_pf_valid:1;
        uint32_t reserved_13:3;
        /** hostslchost_slc0_token1 : RO; bitpos: [27:16]; default: 0;
         *  *******Description***********
         */
        uint32_t hostslchost_slc0_token1:12;
        /** slc0_rx_pf_eof : RO; bitpos: [31:28]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_rx_pf_eof:4;
    };
    uint32_t val;
} sdio_slc_host_slc0host_token_rdata_reg_t;

/** Type of slc0_host_pf register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slc0_pf_data : RO; bitpos: [31:0]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_pf_data:32;
    };
    uint32_t val;
} sdio_slc_host_slc0_host_pf_reg_t;

/** Type of slc1_host_pf register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slc1_pf_data : RO; bitpos: [31:0]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_pf_data:32;
    };
    uint32_t val;
} sdio_slc_host_slc1_host_pf_reg_t;

/** Type of slc0host_int_raw register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slc0_tohost_bit0_int_raw : R/WTC/SS; bitpos: [0]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_tohost_bit0_int_raw:1;
        /** slc0_tohost_bit1_int_raw : R/WTC/SS; bitpos: [1]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_tohost_bit1_int_raw:1;
        /** slc0_tohost_bit2_int_raw : R/WTC/SS; bitpos: [2]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_tohost_bit2_int_raw:1;
        /** slc0_tohost_bit3_int_raw : R/WTC/SS; bitpos: [3]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_tohost_bit3_int_raw:1;
        /** slc0_tohost_bit4_int_raw : R/WTC/SS; bitpos: [4]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_tohost_bit4_int_raw:1;
        /** slc0_tohost_bit5_int_raw : R/WTC/SS; bitpos: [5]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_tohost_bit5_int_raw:1;
        /** slc0_tohost_bit6_int_raw : R/WTC/SS/SC; bitpos: [6]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_tohost_bit6_int_raw:1;
        /** slc0_tohost_bit7_int_raw : R/WTC/SS/SC; bitpos: [7]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_tohost_bit7_int_raw:1;
        /** slc0_token0_1to0_int_raw : R/WTC/SS; bitpos: [8]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_token0_1to0_int_raw:1;
        /** slc0_token1_1to0_int_raw : R/WTC/SS; bitpos: [9]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_token1_1to0_int_raw:1;
        /** slc0_token0_0to1_int_raw : R/WTC/SS; bitpos: [10]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_token0_0to1_int_raw:1;
        /** slc0_token1_0to1_int_raw : R/WTC/SS; bitpos: [11]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_token1_0to1_int_raw:1;
        /** slc0host_rx_sof_int_raw : R/WTC/SS; bitpos: [12]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0host_rx_sof_int_raw:1;
        /** slc0host_rx_eof_int_raw : R/WTC/SS; bitpos: [13]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0host_rx_eof_int_raw:1;
        /** slc0host_rx_start_int_raw : R/WTC/SS; bitpos: [14]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0host_rx_start_int_raw:1;
        /** slc0host_tx_start_int_raw : R/WTC/SS; bitpos: [15]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0host_tx_start_int_raw:1;
        /** slc0_rx_udf_int_raw : R/WTC/SS; bitpos: [16]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_rx_udf_int_raw:1;
        /** slc0_tx_ovf_int_raw : R/WTC/SS; bitpos: [17]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_tx_ovf_int_raw:1;
        /** slc0_rx_pf_valid_int_raw : R/WTC/SS; bitpos: [18]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_rx_pf_valid_int_raw:1;
        /** slc0_ext_bit0_int_raw : R/WTC/SS; bitpos: [19]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_ext_bit0_int_raw:1;
        /** slc0_ext_bit1_int_raw : R/WTC/SS; bitpos: [20]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_ext_bit1_int_raw:1;
        /** slc0_ext_bit2_int_raw : R/WTC/SS; bitpos: [21]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_ext_bit2_int_raw:1;
        /** slc0_ext_bit3_int_raw : R/WTC/SS; bitpos: [22]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_ext_bit3_int_raw:1;
        /** slc0_rx_new_packet_int_raw : R/WTC/SS; bitpos: [23]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_rx_new_packet_int_raw:1;
        /** slc0_host_rd_retry_int_raw : R/WTC/SS; bitpos: [24]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_host_rd_retry_int_raw:1;
        /** gpio_sdio_int_raw : R/WTC/SS/SC; bitpos: [25]; default: 0;
         *  *******Description***********
         */
        uint32_t gpio_sdio_int_raw:1;
        uint32_t reserved_26:6;
    };
    uint32_t val;
} sdio_slc_host_slc0host_int_raw_reg_t;

/** Type of slc1host_int_raw register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slc1_tohost_bit0_int_raw : R/WTC/SS; bitpos: [0]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_tohost_bit0_int_raw:1;
        /** slc1_tohost_bit1_int_raw : R/WTC/SS; bitpos: [1]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_tohost_bit1_int_raw:1;
        /** slc1_tohost_bit2_int_raw : R/WTC/SS; bitpos: [2]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_tohost_bit2_int_raw:1;
        /** slc1_tohost_bit3_int_raw : R/WTC/SS; bitpos: [3]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_tohost_bit3_int_raw:1;
        /** slc1_tohost_bit4_int_raw : R/WTC/SS; bitpos: [4]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_tohost_bit4_int_raw:1;
        /** slc1_tohost_bit5_int_raw : R/WTC/SS; bitpos: [5]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_tohost_bit5_int_raw:1;
        /** slc1_tohost_bit6_int_raw : R/WTC/SS/SC; bitpos: [6]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_tohost_bit6_int_raw:1;
        /** slc1_tohost_bit7_int_raw : R/WTC/SS/SC; bitpos: [7]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_tohost_bit7_int_raw:1;
        /** slc1_token0_1to0_int_raw : R/WTC/SS; bitpos: [8]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_token0_1to0_int_raw:1;
        /** slc1_token1_1to0_int_raw : R/WTC/SS; bitpos: [9]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_token1_1to0_int_raw:1;
        /** slc1_token0_0to1_int_raw : R/WTC/SS; bitpos: [10]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_token0_0to1_int_raw:1;
        /** slc1_token1_0to1_int_raw : R/WTC/SS; bitpos: [11]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_token1_0to1_int_raw:1;
        /** slc1host_rx_sof_int_raw : R/WTC/SS; bitpos: [12]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1host_rx_sof_int_raw:1;
        /** slc1host_rx_eof_int_raw : R/WTC/SS; bitpos: [13]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1host_rx_eof_int_raw:1;
        /** slc1host_rx_start_int_raw : R/WTC/SS; bitpos: [14]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1host_rx_start_int_raw:1;
        /** slc1host_tx_start_int_raw : R/WTC/SS; bitpos: [15]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1host_tx_start_int_raw:1;
        /** slc1_rx_udf_int_raw : R/WTC/SS; bitpos: [16]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_rx_udf_int_raw:1;
        /** slc1_tx_ovf_int_raw : R/WTC/SS; bitpos: [17]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_tx_ovf_int_raw:1;
        /** slc1_rx_pf_valid_int_raw : R/WTC/SS; bitpos: [18]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_rx_pf_valid_int_raw:1;
        /** slc1_ext_bit0_int_raw : R/WTC/SS; bitpos: [19]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_ext_bit0_int_raw:1;
        /** slc1_ext_bit1_int_raw : R/WTC/SS; bitpos: [20]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_ext_bit1_int_raw:1;
        /** slc1_ext_bit2_int_raw : R/WTC/SS; bitpos: [21]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_ext_bit2_int_raw:1;
        /** slc1_ext_bit3_int_raw : R/WTC/SS; bitpos: [22]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_ext_bit3_int_raw:1;
        /** slc1_wifi_rx_new_packet_int_raw : R/WTC/SS; bitpos: [23]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_wifi_rx_new_packet_int_raw:1;
        /** slc1_host_rd_retry_int_raw : R/WTC/SS; bitpos: [24]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_host_rd_retry_int_raw:1;
        /** slc1_bt_rx_new_packet_int_raw : R/WTC/SS; bitpos: [25]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_bt_rx_new_packet_int_raw:1;
        uint32_t reserved_26:6;
    };
    uint32_t val;
} sdio_slc_host_slc1host_int_raw_reg_t;

/** Type of slc0host_int_st register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slc0_tohost_bit0_int_st : RO; bitpos: [0]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_tohost_bit0_int_st:1;
        /** slc0_tohost_bit1_int_st : RO; bitpos: [1]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_tohost_bit1_int_st:1;
        /** slc0_tohost_bit2_int_st : RO; bitpos: [2]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_tohost_bit2_int_st:1;
        /** slc0_tohost_bit3_int_st : RO; bitpos: [3]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_tohost_bit3_int_st:1;
        /** slc0_tohost_bit4_int_st : RO; bitpos: [4]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_tohost_bit4_int_st:1;
        /** slc0_tohost_bit5_int_st : RO; bitpos: [5]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_tohost_bit5_int_st:1;
        /** slc0_tohost_bit6_int_st : RO; bitpos: [6]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_tohost_bit6_int_st:1;
        /** slc0_tohost_bit7_int_st : RO; bitpos: [7]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_tohost_bit7_int_st:1;
        /** slc0_token0_1to0_int_st : RO; bitpos: [8]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_token0_1to0_int_st:1;
        /** slc0_token1_1to0_int_st : RO; bitpos: [9]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_token1_1to0_int_st:1;
        /** slc0_token0_0to1_int_st : RO; bitpos: [10]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_token0_0to1_int_st:1;
        /** slc0_token1_0to1_int_st : RO; bitpos: [11]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_token1_0to1_int_st:1;
        /** slc0host_rx_sof_int_st : RO; bitpos: [12]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0host_rx_sof_int_st:1;
        /** slc0host_rx_eof_int_st : RO; bitpos: [13]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0host_rx_eof_int_st:1;
        /** slc0host_rx_start_int_st : RO; bitpos: [14]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0host_rx_start_int_st:1;
        /** slc0host_tx_start_int_st : RO; bitpos: [15]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0host_tx_start_int_st:1;
        /** slc0_rx_udf_int_st : RO; bitpos: [16]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_rx_udf_int_st:1;
        /** slc0_tx_ovf_int_st : RO; bitpos: [17]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_tx_ovf_int_st:1;
        /** slc0_rx_pf_valid_int_st : RO; bitpos: [18]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_rx_pf_valid_int_st:1;
        /** slc0_ext_bit0_int_st : RO; bitpos: [19]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_ext_bit0_int_st:1;
        /** slc0_ext_bit1_int_st : RO; bitpos: [20]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_ext_bit1_int_st:1;
        /** slc0_ext_bit2_int_st : RO; bitpos: [21]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_ext_bit2_int_st:1;
        /** slc0_ext_bit3_int_st : RO; bitpos: [22]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_ext_bit3_int_st:1;
        /** slc0_rx_new_packet_int_st : RO; bitpos: [23]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_rx_new_packet_int_st:1;
        /** slc0_host_rd_retry_int_st : RO; bitpos: [24]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_host_rd_retry_int_st:1;
        /** gpio_sdio_int_st : RO; bitpos: [25]; default: 0;
         *  *******Description***********
         */
        uint32_t gpio_sdio_int_st:1;
        uint32_t reserved_26:6;
    };
    uint32_t val;
} sdio_slc_host_slc0host_int_st_reg_t;

